Tekla Open API Reference for Tekla Structures 2025
Symbol.SymbolAttributes Class
 The SymbolAttributes class contains the attributes for the symbol.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.Symbol.SymbolAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class SymbolAttributes : AttributesBase,
	IPreferredPlacing
<SerializableAttribute>
Public NotInheritable Class SymbolAttributes
	Inherits AttributesBase
	Implements IPreferredPlacing
The Symbol.SymbolAttributes type exposes the following members.
Constructors
Name | Description
Symbol.SymbolAttributes()
 Creates a new default symbol attributes instance that loads standard attributes.
Symbol.SymbolAttributes(String)
 Creates a symbol attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Angle
 The angle of the symbol. Cannot be changed for an editor-created symbol when the symbol is created "along line".
Color
 The symbol color. Does not have an effect on symbols where the color is already defined in the symbol file.
Frame
 The frame for the symbol.
Height
 The height of the symbol.
PreferredPlacing
 The type of placing the object should use. See the preferred placing types for different types of placing.
TrueColor
 The true color (RGB enabled) of the symbol. Does not have an effect on symbols where the color is already defined in the symbol file.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace